In [3]:
import pandas as pd
import numpy as np

In [4]:
df_users = pd.DataFrame(
    {
        "name":['Maria', 'Petyr', 'Ivan'],
        "age":[23, 21, 34],
        "gender":['female', 'male', 'male']
    }
)

df_users

    name  age  gender
0  Maria   23  female
1  Petyr   21    male
2   Ivan   34    male

In [5]:
csv_file_path = 'https://raw.githubusercontent.com/geekcourses/JupyterNotebooksExamples/master/datasets/various/drinks.csv'

df = pd.read_csv(csv_file_path)
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

## Series Object

In [6]:
a = np.array([1,2,3,4])
a

array([1, 2, 3, 4])

In [8]:
s = pd.Series(a, index=['a', 'b', 'c', 'd'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
print("Index:", s.index)  # The index (axis labels) of the Series
print("Values:", s.values)  # The values of the Series
print("Shape:", s.shape)  # The shape of the Series (number of elements)

Index: Index(['a', 'b', 'c', 'd'], dtype='object')
Values: [1 2 3 4]
Name: None
Shape: (4,)

In [15]:
s.index = [1,2,3,4]
s

1    1
2    2
3    3
4    4
dtype: int64

In [16]:
prices = pd.Series(
    [1.5, 2, 2.5, 3],
    index=["apples", "oranges", "bananas", "strawberries"]
)
prices

apples          1.5
oranges         2.0
bananas         2.5
strawberries    3.0
dtype: float64

In [35]:
prices.loc['strawberries']

3.0

In [28]:
s

1    1
2    2
3    3
4    4
dtype: int64

In [29]:
s.iloc[1]

2

In [30]:
test = pd.Series(
    {
        "a-1":1,
        "b":2
    }
)
test

a-1    1
b      2
dtype: int64

In [32]:
# test.loc['a-1']
test['a-1']

1

In [36]:
# test.loc['b']
# test['b']
test.b

2

### List as index

In [39]:
prices

apples          1.5
oranges         2.0
bananas         2.5
strawberries    3.0
dtype: float64

In [40]:
prices.loc[ ['apples','apples' ] ]

apples    1.5
apples    1.5
dtype: float64

In [43]:
prices.iloc[ [0,0 ] ]

apples    1.5
apples    1.5
dtype: float64

In [44]:
prices.loc[ ['apples', 'oranges'] ]

apples     1.5
oranges    2.0
dtype: float64

### Boolean indexing

In [48]:
prices

apples          1.5
oranges         2.0
bananas         2.5
strawberries    3.0
dtype: float64

In [51]:
mask = (prices>2).values
mask

array([False, False,  True,  True])

In [55]:
# prices.iloc[mask]
# prices.loc[mask]
prices[mask]

bananas         2.5
strawberries    3.0
dtype: float64

In [58]:
mask_s = prices>2
mask_s.index = [1,2,3,4]
mask_s

1    False
2    False
3     True
4     True
dtype: bool

In [60]:
# prices[mask_s]

In [61]:
prices[ prices<=2 ]

apples     1.5
oranges    2.0
dtype: float64

In [65]:
prices.iloc[1:3]

oranges    2.0
bananas    2.5
dtype: float64

In [68]:
prices.loc['oranges':'strawberries':2]

oranges         2.0
strawberries    3.0
dtype: float64

In [77]:
prices.loc['bananas'::-1]
# prices

bananas    2.5
oranges    2.0
apples     1.5
dtype: float64

In [81]:
prices.iloc[-2::]

bananas         2.5
strawberries    3.0
dtype: float64

### Series Operation

In [83]:
# Create sample Series
s1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
s2 = pd.Series([4, 5, 6], index=['a', 'b', 'c'])
s3 = pd.Series([7, 8, 9], index=['a', 'x', 'y'])
print(s1)
print(s2)
print(s3)

a    1
b    2
c    3
dtype: int64
a    4
b    5
c    6
dtype: int64
a    7
x    8
y    9
dtype: int64

In [85]:
s1+s2

a    5
b    7
c    9
dtype: int64

In [86]:
s1+s3

a    8.0
b    NaN
c    NaN
x    NaN
y    NaN
dtype: float64

In [90]:
'x' in s3

True

## Series is A DataFrame column

In [91]:
csv_file_path = 'https://raw.githubusercontent.com/geekcourses/JupyterNotebooksExamples/master/datasets/various/drinks.csv'

df = pd.read_csv(csv_file_path)
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [95]:
s = df['country']
type(s)

pandas.core.series.Series